------------------------------------------------------------------
--      desc: 服务器、框架完全加载之后的处理脚本
--      author: zenghui
--      date: 2017-3-27
--      attention: 网站启动时将自动执行此文件一次。
--      注意此文件执行之时服务器、框架、模块已经完全加载完毕。
--      可以在这个文件里加入一些业务脚本
--	    e.g. NPL.load("(gl)www/service/xxx.lua");
------------------------------------------------------------------


------------------------------------------------------------------
--  这里加载web应用需要的公共模块
--	e.g. NPL.load("(gl)www/utils/stlutil.lua");
------------------------------------------------------------------


------------------------------------------------------------------
--  这里注册web应用的各种过滤器
------------------------------------------------------------------

--[[
    nwf.registerFilter(function(ctx, doNext)
        local req = ctx.request;
        local res = ctx.response;
        doSomething();
        doNext();
        doSomething();
    end);
]]


------------------------------------------------------------------
--  网站启动成功的提示信息
------------------------------------------------------------------
print("nwf application starting completed.");
